app/views/home/trip_plan.html.erb

						                            <div class="form-group">
						                            <!--< Plan.all.each do |p| %>-->
---
SELECT "plans".* FROM "plans"