app/views/home/trip_memo.html.erb

									                        <div class="form-group">
									                            <!--< Plan.all.each do |p| %>-->
---
SELECT "plans".* FROM "plans"