app/controllers/home_controller.rb

SELECT "plans".* FROM "plans" WHERE "plans"."id" = ?  [["id", 6]]
SELECT "memos".* FROM "memos" WHERE "memos"."plan_id" = ?  [["plan_id", 1]]
---
  def trip_memo
      # @every_memo=Memo.all.order("id desc")
       @plan_id = params[:id]
       @plans =  Plan.where(id: @plan_id)
       @memos = Memo.where(plan_id: @plan_id)

SELECT "plans".* FROM "plans"
---
  def trip_plan
        @every_plan = Plan.all

INSERT INTO "plans" ("title", "day", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "eee"], ["day", 3], ["created_at", "2016-08-24 14:37:33.488891"], ["updated_at", "2016-08-24 14:37:33.488891"]]
---
  def plan_write
        @plans = Plan.all.order("id desc")
        plan = Plan.new
        plan.title = params[:nameoftrip]
        plan.day = params[:dayoftrip]
        # plan.user_id = current_user.id
        plan.save

SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "plans" WHERE "plans"."id" = ?  [["id", 1]]
---
  def plan_destroy
       @temp = Plan.find(params[:plan_id])
       @temp.destroy

SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "plans" SET "title" = ?, "updated_at" = ? WHERE "plans"."id" = ?  [["title", "수정하기"], ["updated_at", "2016-08-26 08:21:05.340767"], ["id", 3]]
---
  def plan_update
       @updated_plan = Plan.find(params[:plan_id])
       @updated_plan.title = params[:nameoftrip]
       @updated_plan.day = params[:dayoftrip]
       @updated_plan.save

INSERT INTO "memos" ("memotitle", "plan_id") VALUES (?, ?)  [["memotitle", "1"], ["plan_id", 1]]
---
  def memo_write
       memo = Memo.new
       memo.memotitle = params[:nameofmemo]
       memo.memocontent = params[:contentofmemo]
       memo.plan_id = params[:plan_id]
      # memo.object = params[:object]
       memo.save